//Библиотека иска да организира информация за книгите които притежава в информационна система.
//За всяка книга тя събира следните данни : име, автор, жанр и  година на издаване.
//За авторите се съхранява информация за име, фамилия и националност.
//Жанровете са : класика, детски, гантастика, биографичен, любовен.
//
//01. Реалицирайте добавяне на нова книга.
//02. Реализирайте операция добавяне на книга.
//
//03. Реализирайте търсене на книга по име или част от името.
//04. Въвеждайте параметрите на търсенето ччрез стандартен вход.
//05. Покажете резултатите.
//
//06. Реализирайте търсене на книга по автор.Покажате резултатите.
//
//За съхраняване на информация използвайте файлове и сериализация.