//Дадено ни е училище. В училището има паралелки от ученици. Всеки клас има набор от учители. Всеки учител преподава
// набор от дисциплини. Учениците имат име и уникален номер на класа. Класовете имат уникален текстов идентификатор.
// 4Учителите имат име и титла. Дисциплините имат наименование, брой лекции и брой упражнения.
//2. Дефинирайте класове по C++ за училището (училище, клас, ученик, учител, дисциплина). Съхранявайте полетата
// на членовете частни. Добавете конструктори и методи за достъп. Напишете клас за тестване, за да конструирате и
// отпечатате примерно училище.
